[
  {
    "image": "",
    "title": "Frontend Developer",
    "date": "October 2024 - Present",
    "company": "Early-stage Fintech Startup",
    "type": "Freelance Developer",
    "skills": [
      "ReactJS, ",
      "Typescript, ",
      "TailwindCSS, ",
      "REST API, ",
      "Figma, ",
      "Git"
    ],
    "location": "Bhubaneswar, India",
    "description": [
      "Developing a properietary B2C Data aggregation web application for an early stage startup"
    ]
  },
  {
    "image": "/experience/GolfPost.jpg",
    "title": "Frontend Developer",
    "date": "April 2024 - September 2024",
    "company": "GolfPost AG",
    "type": "Working Student",
    "skills": [
      "Svelte,",
      "Javascript, ",
      "TailwindCSS, ",
      "REST API, ",
      "Figma, ",
      "Git"
    ],
    "location": "Cologne, Germany",
    "reference": "/docs/Golfpost.pdf",
    "description": [
      "Developed a fantasy gaming web application using SvelteKit and Tailwind, creating components and modular functionalities, and integrating a RESTful API with live data",
      "Developed core features for the fantasy application including Player and User dashboards, Player Picker, Tournament and League management tools and user authentication",
      "Developed an end-to-end, members-exclusive company portfolio website, focusing on enhancing the user interface and integrating multi-language support",
      "Collaborating with an agile team of developers, leveraging the Scrum methodology to ensure timely deployment of product"
    ]
  },
  {
    "image": "/experience/V4C.png",
    "title": "Web Developer",
    "date": "March 2023 - July 2023",
    "company": "V4C Management Consulting",
    "type": "Working Student",
    "skills": [
      "Next.js, ",
      "TypeScript, ",
      "TailwindCSS, ",
      "REST API, ",
      "PostgreSQL, ",
      "MongoDB, ",
      "Wordpress, ",
      "Docker, ",
      "AWS, ",
      "Figma, ",
      "Git"
    ],
    "location": "Munich, Germany",
    "reference": "/docs/V4C.pdf",
    "description": [
      "Worked on the design and development of large scale dynamic company website, including blog features, user and admin dashboards, customer support, and user authentication",
      "Designed database schemas, developed and hosted relational and non-relational databases on Amazon AWS for managing user and company data, each with a distinct REST API endpoint for accessibility",
      "Leveraged a microservice architecture with Docker for containerising Frontend, APIs, and Databases for enhanced scalability and faster deployment of the company website and its features",
      "Maintained and managed a legacy company website on Wordpress, in communication with management to deploy custom plugins, performance optimisation and regular updates"
    ]
  },
  {
    "image": "/experience/LeanERA.png",
    "title": "Frontend Developer",
    "date": "Aug 2022 - Jan 2023",
    "company": "LeanERA",
    "type": "Working Student",
    "skills": [
      "TypeScript, ",
      "Vue.js, ",
      "Nuxt.js, ",
      "Ionic, ",
      "TailwindCSS, ",
      "Pinia, ",
      "Git"
    ],
    "location": "Leipzig, Germany",
    "reference": "/docs/LeanERA.pdf",
    "description": [
      "Supported Frontend Development team by working on design, development, and implementation of Progressive Web Application (PWA) and Mobile Applications using Vue, TailwindCSS and Ionic Framework.",
      "Collaborated with Design, Project Management and QA Team during groom meetings to develop and implement components, functionalities, and features based on customer requirements.",
      "Practiced pair programming to develop dynamic Nuxt-based responsive web applications, and fetch data from the CDN",
      "Successfully developed and deployed a general-purpose customizable video chat module package for the company, compatible with mobile application projects built with Vue and Ionic.",
      "Leveraged Typescript to maximise scalability, refactoring, team collaboration, developer experience and code maintainability."
    ]
  },
  {
    "image": "/experience/Codepth.jpeg",
    "title": "Frontend Developer",
    "date": "July 2019 - July 2020",
    "company": "Codepth .LLC",
    "type": "Co-Founder",
    "skills": [
      "ReactJS, ",
      "NodeJS, ",
      "MongoDB, ",
      "MySQL, ",
      "Python, ",
      "JavaScript, ",
      "TailwindCSS, ",
      "BootstrapCSS, ",
      "HTML/CSS, ",
      "Figma, ",
      "Git"
    ],
    "location": "Bhubaneswar, India",
    "description": [
      "Built responsive web applications, for small businesses and individual clients with ReactJS, NextJS, NodeJS, MongoDB, Javascript, TailwindCSS, BootstrapCSS and HTML/CSS.",
      "Designed and pitched Web and Mobile application prototypes to clients and developers using Figma.",
      "Responsible for developing and maintaining the startup's digital infrastructures, including relational and non-relational database clusters using MongoDB and MySQL.",
      "Interacted with end-users to analyse user feedback, fix production issues and add new technical features, based on customer feedback.",
      "Created and maintained technical documentation and user manuals for junior developers and end-users respectively."
    ]
  }
]
