[
  {
    "title": "My Personal Web App.",
    "description": "Created a professional portfolio with Next.js and Tailwind CSS, featuring a responsive design, blog, comprehensive portfolio, client testimonials, and services. User-centric with a dark theme, it's an effective platform for showcasing work and attracting clients.",
    "buttonText": "Open",
    "link":"https://github.com/borneelphukan/borneel.phukan"
  },
  {
    "title": "BDesign Corporate Theme Template",
    "description": "Introducing my Next.js and TailwindCSS powered BDesign Corporate Website Template: A dynamic and visually appealing solution for businesses of all sizes. With customizable components and Responsive web views, this template empowers you to create a professional online presence effortlessly.",
    "buttonText": "Open",
    "link":"https://bdesign-corporate.netlify.app/"
  },
  {
    "title": "BShop E-Commerce Website Template",
    "description": "Introducing BShop Ecommerce Template – the ultimate solution for your online store. Built with Next.js, TailwindCSS, and Typescript, it offers a sleek design and seamless performance. Elevate your E-Commerce game effortlessly, with BShop – where style meets functionality for a standout online shopping experience.",
    "buttonText": "Open",
    "link":"https://bshop-ecommerce.netlify.app/"
  },
  {
    "title": "Movie Database Management",
    "description": "Built with PHP and Postgresql, this user-friendly application features a personalized recommended movie section based on user preferences, along with comprehensive details about movies, cast, genres, and more. Explore movies with this intuitive interface tailored to enhance your movie- experience.",
    "buttonText": "Open",
    "link":"https://github.com/borneelphukan/Movie-Recommender-System.git"
  },
    {
    "title": "COVID19 Social Distance Monitor",
    "description": "Introducing the COVID-19 Social Distance Monitor project, chosen for deployment in the Assam Police Hackathon 2020. Powered by OpenCV and YOLO v3, it uses Euclidean distance to ensure social distancing compliance. Enhance public safety by providing real-time monitoring to mitigate the spread of COVID-19.",
    "buttonText": "Open",
    "link":"https://github.com/borneelphukan/Covid-19-Social-Distancing-Monitor"
  },
    {
    "title": "Facial Emotion Recognition",
    "description": "A Facial Emotion Recognition project, developed using Tensorflow and OpenCV with Python. This versatile application is trained using the FER2013 dataset and accurately identifies the 7 major emotions from the dataset. Working on its deployment as an API for seamless integration into various platforms and services.",
    "buttonText": "Open",
    "link":"https://github.com/borneelphukan/Facial-Emotion-Recognition.git"
  }
]