{
    "role1":"Software Developer",
    "role2":"ML/AI Engineer",
    "description":"A Software Developer and AI Engineer focusing on developing customer-oriented applications, designing impactful APIs, clean User Interfaces, Machine Learning and Deep Learning models and delivering successful projects to drive business growth and revenues.",
    "footerText":"Welcome to my personal website, where I proudly showcase my strengths and skills. Explore my journey, accomplishments, and occasional blog posts. Thank you for visiting!",
    "aboutme":[
        "Hi! I'm Borneel, a Software Developer and Machine Learning Engineer committed to developing and delivering state-of-the-art full-stack web and mobile applications, secured APIs, clean User Interfaces and building Machine Learning and Deep Learning models with minimal loss outputs, all by leveraging suitable Agile Methodologies. My passion for developing impactful applications and contributing to technology growth has driven me to pursue a career in the field of web engineering and artificial intelligence. My contributions to open-source development on GitHub and my research publication on Deep Neural Networks can provide you with a preliminary idea about my work and contributions so far.", 
        "I am a self-taught programmer with 2+ years of experience spanning across my own projects as well as in the industry, and my top expertise lies in development using Javascript/Typescript, Next.js, React, Vue, Node.js, PHP, Python, TailwindCSS and more. My commitment to staying abreast of industry trends and willingness to share my knowledge is well reflected in my contributions to multiple online publishing platforms including my blogposts. I offer a unique blend of skills covering domains from full-stack web development and designing to machine learning.  I am currently pursuing my master’s in Web Engineering from Chemnitz University of Technology, Germany, and I am a graduate of Computer Science and System Engineering from Kalinga Institute of Industrial Technology, Bhubaneswar, India. Other than development, I am also a part-time photographer with a special knack for travel, nature and architecture photography. If you're seeking a dedicated professional with a creative flair and technical acumen for your team, look no further.", 
        "The purpose of this website is to provide a comprehensive platform to showcase and categorise my projects, articles and experiences. It's a peek into my life, where you can explore my journey so far, both professional and personal. I have an extensive portfolio of experiences as a student of computer science, as a frontend and full-stack developer in startups and as a machine learning hobbyist with impactful projects and research papers in world-renowned publications. Peek into the projects I've worked on and the skills I've gained over the years. Additionally, you can dive into my travel blogs, and technical writings, including a glimpse into what you learn in academia, and research findings through engaging blog posts. Beyond the veil of technology, you'll find a peek into my interests, hobbies, and my hobby photographs. Whether you're here for my work or simply to get to know me better, this website offers everything about who I am and what I'm passionate about. Welcome and thank you for visiting."
    ]
}